In [2]:
import pandas as pd

In [3]:
import pandas as pd


df = pd.DataFrame({
    "Name": ["Ahmed", "Sara", "Mona"],
    "Age": [25, 30, 22]
})

pd.value_counts(df)

C:\Users\almnara\AppData\Local\Temp\ipykernel_13460\366851832.py:9: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(df)
C:\Users\almnara\AppData\Local\Temp\ipykernel_13460\366851832.py:9: FutureWarning: value_counts with argument that is not not a Series, Index, ExtensionArray, or np.ndarray is deprecated and will raise in a future version.
  pd.value_counts(df)

Name    1
Age     1
Name: count, dtype: int64

In [4]:
pd.value_counts(df)

C:\Users\almnara\AppData\Local\Temp\ipykernel_13460\4010155336.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(df)
C:\Users\almnara\AppData\Local\Temp\ipykernel_13460\4010155336.py:1: FutureWarning: value_counts with argument that is not not a Series, Index, ExtensionArray, or np.ndarray is deprecated and will raise in a future version.
  pd.value_counts(df)

Name    1
Age     1
Name: count, dtype: int64

In [5]:
s1 = [1,0,2,1,3,1]
s1 =pd.Series(s1,index= [0,1,2,3,4,5])
s1.loc[0] = 55
s1[s1 >= 0 ] = 5 
print(s1)

0    5
1    5
2    5
3    5
4    5
5    5
dtype: int64

In [6]:
df =pd.read_csv('test.csv')

df = df.drop(['Benefits','Year' , 'TotalPayBenefits'],axis=1)
print(df.head())

   Id       EmployeeName                                        JobTitle  \
0   1     NATHANIEL FORD  GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
1   2       GARY JIMENEZ                 CAPTAIN III (POLICE DEPARTMENT)
2   3     ALBERT PARDINI                 CAPTAIN III (POLICE DEPARTMENT)
3   4  CHRISTOPHER CHONG            WIRE ROPE CABLE MAINTENANCE MECHANIC
4   5    PATRICK GARDNER    DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)

     BasePay  OvertimePay   OtherPay   TotalPay
0  167411.18         0.00  400184.25  567595.43
1  155966.02    245131.88  137811.38  538909.28
2  212739.13    106088.18   16452.60  335279.91
3   77916.00     56120.71  198306.90  332343.61
4  134401.60      9737.00  182234.59  326373.19

In [7]:
df.TotalPay.mode()

0     251685.16
1     251935.01
2     253269.44
3     257124.44
4     257540.09
5     258364.22
6     258588.39
7     259684.88
8     259927.11
9     260297.66
10    261366.14
11    264074.60
12    265463.46
13    265784.56
14    267992.59
15    270324.91
16    270672.63
17    273702.71
18    273771.21
19    274190.27
20    274550.25
21    276434.22
22    278569.21
23    284720.43
24    286213.86
25    286347.05
26    292671.62
27    294580.02
28    297608.92
29    299494.17
30    302377.73
31    303427.55
32    307899.46
33    315981.05
34    316285.74
35    326373.19
36    332343.61
37    335279.91
38    538909.28
39    567595.43
Name: TotalPay, dtype: float64

In [8]:
s =pd.Series([1,2,3,4,5] , index= ['A','B','C','D','H'])
s

A    1
B    2
C    3
D    4
H    5
dtype: int64

In [9]:
data = [[1,255,'a',4],
        [2,454,'b',45],
        [3,565,'w','a'],
        [4,554]]

df = pd.DataFrame(data , columns=['colum 1','colum 2','colum','colum'] )
c = ['colum 1','colum 2','colum 3 ','colum 4']
df.columns=c
ind = ['Row 1', 'Row 2' , 'Row 3  ' ,'Row 4'] 
df.index =ind
df

         colum 1  colum 2 colum 3  colum 4
Row 1          1      255        a       4
Row 2          2      454        b      45
Row 3          3      565        w       a
Row 4          4      554     None    None

In [10]:
data = {'column 1':[1,2,3,4],
        'column 2':[123,454,46,45],
        'column 3':['f','s','d',5]}

df = pd.DataFrame(data)
df

   column 1  column 2 column 3
0         1       123        f
1         2       454        s
2         3        46        d
3         4        45        5

In [11]:
print(pd.__version__)

2.3.3

In [12]:
np.arr

NameError: name 'np' is not defined

In [ ]:
data = [1001,200,24521,552,4,54,6]
series = pd.Series(data,index=['a','b','c','f','g','h','j'])
series.loc[0]= 52
print(series[series <= 200])

b    200
g      4
h     54
j      6
0     52
dtype: int64

In [15]:
df = pd.read_csv("test.csv")
df.head()
df = df.drop('Year', axis=1)
df = df.drop('Benefits' , axis= 1)

df.head(4)
df['TotalPay'] = df['TotalPay'].astype('int64')
df['OtherPay'] = df['OtherPay'].astype('int64')
df.head(4)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,TotalPay,TotalPayBenefits
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184,567595,567595.43
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811,538909,538909.28
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452,335279,335279.91
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306,332343,332343.61

In [ ]:

df.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'TotalPay', 'TotalPayBenefits'],
      dtype='object')

In [ ]:
df['BasePay'].unique()

array([167411.18, 155966.02, 212739.13,  77916.  , 134401.6 , 118602.  ,
        92492.01, 256576.96, 176932.64, 285262.  , 194999.39,  99722.  ,
       294580.02, 271329.03, 174872.64, 198778.01, 268604.57, 140546.87,
       168692.63, 257510.59, 257510.48, 257510.44, 140546.88, 140546.86,
       256470.41,  92080.8 , 168692.59, 261717.6 , 246225.6 , 234325.02,
       254027.63, 248895.7 , 104861.39, 177781.25, 101953.2 , 245124.44,
       110661.2 , 132202.26, 147158.85])

In [ ]:
df['TotalPay'].min()

np.int64(251685)

In [ ]:
df['TotalPay'].idxmin()

39

In [ ]:
report = data_analysis_report(df)

report['numeric_describe']
report['missing_percentage']
report['suggested_drop_columns']

[]

In [ ]:
def get_feature(df ) :

In [ ]:
get_feature(df)

(Id                      40.00
 BasePay             294580.02
 OvertimePay         245131.88
 OtherPay            400184.25
 TotalPay            567595.43
 TotalPayBenefits    567595.43
 dtype: float64,
 Id                       1.00
 BasePay              77916.00
 OvertimePay              0.00
 OtherPay                 0.00
 TotalPay            251685.16
 TotalPayBenefits    251685.16
 dtype: float64,
 Id                      20.50000
 BasePay             187373.01300
 OvertimePay          47126.84525
 OtherPay             59835.69625
 TotalPay            294335.55450
 TotalPayBenefits    294335.55450
 dtype: float64,
     Id    BasePay  OvertimePay   OtherPay   TotalPay  TotalPayBenefits
 0    1  168692.63          0.0       0.00  251685.16         251685.16
 1    2        NaN          NaN    2357.00  251935.01         251935.01
 2    3        NaN          NaN    5899.48  253269.44         253269.44
 3    4        NaN          NaN   10789.18  257124.44         257124.44
 4    5        NaN          NaN   11522.18  257540.09         257540.09
 5    6        NaN          NaN   12000.00  258364.22         258364.22
 6    7        NaN          NaN   13957.65  258588.39         258588.39
 7    8        NaN          NaN   15140.54  259684.88         259684.88
 8    9        NaN          NaN   15883.56  259927.11         259927.11
 9   10        NaN          NaN   16063.99  260297.66         260297.66
 10  11        NaN          NaN   16115.86  261366.14         261366.14
 11  12        NaN          NaN   16159.50  264074.60         264074.60
 12  13        NaN          NaN   16452.60  265463.46         265463.46
 13  14        NaN          NaN   16483.94  265784.56         265784.56
 14  15        NaN          NaN   16679.79  267992.59         267992.59
 15  16        NaN          NaN   17115.73  270324.91         270324.91
 16  17        NaN          NaN   18625.08  270672.63         270672.63
 17  18        NaN          NaN   20658.00  273702.71         273702.71
 18  19        NaN          NaN   21342.59  273771.21         273771.21
 19  20        NaN          NaN   24083.86  274190.27         274190.27
 20  21        NaN          NaN   25972.64  274550.25         274550.25
 21  22        NaN          NaN   31909.28  276434.22         276434.22
 22  23        NaN          NaN   33149.90  278569.21         278569.21
 23  24        NaN          NaN   37424.11  284720.43         284720.43
 24  25        NaN          NaN   38115.47  286213.86         286213.86
 25  26        NaN          NaN   39540.46  286347.05         286347.05
 26  27        NaN          NaN   39955.25  292671.62         292671.62
 27  28        NaN          NaN   40132.23  294580.02         294580.02
 28  29        NaN          NaN   51322.50  297608.92         297608.92
 29  30        NaN          NaN   67083.83  299494.17         299494.17
 30  31        NaN          NaN  103499.39  302377.73         302377.73
 31  32        NaN          NaN  110804.30  303427.55         303427.55
 32  33        NaN          NaN  111446.20  307899.46         307899.46
 33  34        NaN          NaN  133695.76  315981.05         315981.05
 34  35        NaN          NaN  134426.14  316285.74         316285.74
 35  36        NaN          NaN  137811.38  326373.19         326373.19
 36  37        NaN          NaN  182234.59  332343.61         332343.61
 37  38        NaN          NaN  189082.74  335279.91         335279.91
 38  39        NaN          NaN  198306.90  538909.28         538909.28
 39  40        NaN          NaN  400184.25  567595.43         567595.43)

In [ ]:
df.duplicated().sum()

np.int64(0)

In [ ]:
df.isnull().sum()

Id                  0
EmployeeName        0
JobTitle            0
BasePay             0
OvertimePay         0
OtherPay            0
TotalPay            0
TotalPayBenefits    0
dtype: int64

In [17]:
df.iloc[: 2]
df['TotalPayBenefits'] = df.TotalPay - df.TotalPayBenefits

df.head(5)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,TotalPay,TotalPayBenefits
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184,567595,567595.43
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811,538909,538909.28
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452,335279,335279.91
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306,332343,332343.61
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234,326373,326373.19

In [25]:
df.to_csv('new.csv')

In [28]:
dfn = pd.read_csv('new.csv')
dfn.head(5)

,Unnamed: 0,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,TotalPay,TotalPayBenefits
0,0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184,567595,567595.43
1,1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811,538909,538909.28
2,2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452,335279,335279.91
3,3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306,332343,332343.61
4,4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234,326373,326373.19

In [23]:
df.shape

(40, 8)

In [22]:
df['JobTitle'].head(5)

0    GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
1                   CAPTAIN III (POLICE DEPARTMENT)
2                   CAPTAIN III (POLICE DEPARTMENT)
3              WIRE ROPE CABLE MAINTENANCE MECHANIC
4      DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)
Name: JobTitle, dtype: object

In [21]:
mean = df.TotalPay.mean()
df.JobTitle = df.JobTitle.fillna(value= mean)

In [18]:
nul = df.isnull().sum()
pd.DataFrame(nul).T

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,TotalPay,TotalPayBenefits
0,0,0,0,0,0,0,0,0

In [ ]:
new = {'EmployeeName': ' mohaned '}

In [ ]:
new = df.Id
df.insert(0)

TypeError: DataFrame.insert() missing 2 required positional arguments: 'column' and 'value'

In [ ]:
def get_feature(df , column ):
    
    duplicated = df.duplicated().sum()
    nulls = df.isnull().sum().sum()
    max_v = df[column].max()
    min_v = df[column].min()
    
    return f"your nulls {nulls}  duplicated rows {duplicated} max in your colum {max_v}"

In [ ]:
get_feature(df,column='TotalPay')

'your nulls 0  duplicated rows 0 max in your colum 567595'

In [ ]:
def get_feature(df):
    duplicates = df.duplicated().sum()
    nulls = df.isnull().sum().sum()
    return {"duplicates": duplicates, "nulls": nulls}

In [ ]:
get_feature(df)

{'duplicates': np.int64(0), 'nulls': np.int64(0)}

In [ ]:
max_v, min_v, mean_v,mode_vals = get_feature(df)
print("-------------mix-----------")

print(max_v)
print("-------------min-----------")

print(min_v)

print("-------------mean-----------")

print(mean_v)

-------------mix-----------
Id                      40.00
BasePay             294580.02
OvertimePay         245131.88
OtherPay            400184.25
TotalPay            567595.43
TotalPayBenefits    567595.43
dtype: float64
-------------min-----------
Id                       1.00
BasePay              77916.00
OvertimePay              0.00
OtherPay                 0.00
TotalPay            251685.16
TotalPayBenefits    251685.16
dtype: float64
-------------mean-----------
Id                      20.50000
BasePay             187373.01300
OvertimePay          47126.84525
OtherPay             59835.69625
TotalPay            294335.55450
TotalPayBenefits    294335.55450
dtype: float64
    Id    BasePay  OvertimePay   OtherPay   TotalPay  TotalPayBenefits
0    1  168692.63          0.0       0.00  251685.16         251685.16
1    2        NaN          NaN    2357.00  251935.01         251935.01
2    3        NaN          NaN    5899.48  253269.44         253269.44
3    4        NaN          NaN   10789.18  257124.44         257124.44
4    5        NaN          NaN   11522.18  257540.09         257540.09
5    6        NaN          NaN   12000.00  258364.22         258364.22
6    7        NaN          NaN   13957.65  258588.39         258588.39
7    8        NaN          NaN   15140.54  259684.88         259684.88
8    9        NaN          NaN   15883.56  259927.11         259927.11
9   10        NaN          NaN   16063.99  260297.66         260297.66
10  11        NaN          NaN   16115.86  261366.14         261366.14
11  12        NaN          NaN   16159.50  264074.60         264074.60
12  13        NaN          NaN   16452.60  265463.46         265463.46
13  14        NaN          NaN   16483.94  265784.56         265784.56
14  15        NaN          NaN   16679.79  267992.59         267992.59
15  16        NaN          NaN   17115.73  270324.91         270324.91
16  17        NaN          NaN   18625.08  270672.63         270672.63
17  18        NaN          NaN   20658.00  273702.71         273702.71
18  19        NaN          NaN   21342.59  273771.21         273771.21
19  20        NaN          NaN   24083.86  274190.27         274190.27
20  21        NaN          NaN   25972.64  274550.25         274550.25
21  22        NaN          NaN   31909.28  276434.22         276434.22
22  23        NaN          NaN   33149.90  278569.21         278569.21
23  24        NaN          NaN   37424.11  284720.43         284720.43
24  25        NaN          NaN   38115.47  286213.86         286213.86
25  26        NaN          NaN   39540.46  286347.05         286347.05
26  27        NaN          NaN   39955.25  292671.62         292671.62
27  28        NaN          NaN   40132.23  294580.02         294580.02
28  29        NaN          NaN   51322.50  297608.92         297608.92
29  30        NaN          NaN   67083.83  299494.17         299494.17
30  31        NaN          NaN  103499.39  302377.73         302377.73
31  32        NaN          NaN  110804.30  303427.55         303427.55
32  33        NaN          NaN  111446.20  307899.46         307899.46
33  34        NaN          NaN  133695.76  315981.05         315981.05
34  35        NaN          NaN  134426.14  316285.74         316285.74
35  36        NaN          NaN  137811.38  326373.19         326373.19
36  37        NaN          NaN  182234.59  332343.61         332343.61
37  38        NaN          NaN  189082.74  335279.91         335279.91
38  39        NaN          NaN  198306.90  538909.28         538909.28
39  40        NaN          NaN  400184.25  567595.43         567595.43

In [ ]:
df.describe()

       column 1    column 2
count  4.000000    4.000000
mean   2.500000  167.000000
std    1.290994  194.790486
min    1.000000   45.000000
25%    1.750000   45.750000
50%    2.500000   84.500000
75%    3.250000  205.750000
max    4.000000  454.000000

In [ ]:
df['TotalPay'] = df['TotalPay'].astype('int64')
df['OtherPay'] = df['OtherPay'].astype('int64')

In [ ]:
#df.replace('NATHANIEL FORD','mohamed hany')

In [ ]:
df.idx

AttributeError: 'DataFrame' object has no attribute 'idx'

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40 entries, 0 to 39
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Id                40 non-null     int64
 1   EmployeeName      40 non-null     object
 2   JobTitle          40 non-null     object
 3   BasePay           40 non-null     float64
 4   OvertimePay       40 non-null     float64
 5   OtherPay          40 non-null     int64
 6   TotalPay          40 non-null     int64
 7   TotalPayBenefits  40 non-null     float64
dtypes: float64(3), int64(3), object(2)
memory usage: 2.6+ KB

In [ ]:
df.dtypes

Id                    int64
EmployeeName         object
JobTitle             object
BasePay             float64
OvertimePay         float64
OtherPay            float64
TotalPay              int64
TotalPayBenefits    float64
dtype: object

In [ ]:
S= pd.Series([8,2,3,4,5])
ind = ([0,1,2,3,4])
S.index = ind
S.loc[0] = 58
print(S[S >= 5])

0    58
4     5
dtype: int64

In [ ]:
mat = ({'column 1'  : [1,2,3,4,5],
        'coulumn 2' : [4,5,6,7,8],
        'coulumn 3' : [1,2,52,3,5]})


ind = ['a','b','c','f','g']



mat = pd.DataFrame(mat)
mat.index = ind


print(display(mat))

   column 1  coulumn 2  coulumn 3
a         1          4          1
b         2          5          2
c         3          6         52
f         4          7          3
g         5          8          5

None

In [ ]:
cols = ['column 1','coulumn 2']
mat[cols] = mat[cols].astype('int')

In [ ]:
mat['column 1'].dtypes

dtype('int64')

In [ ]:
c = {'day1': 1544,'day2':225} 
c = pd.Series(c)
c.loc['day1'] += 500 

print(c[c > 1000])

day1    2044
dtype: int64

In [ ]:
c = {'day 1 ': [1544],'day2':[225]} 
c = pd.DataFrame(c)
ind = [1]
c.index = ind
c

   day 1   day2
1    1544   225

In [ ]:
mat2 = [[1,2,3,4,5],
        [2,3,4,5,4],
        [3,4,5,4,5]]
mat2 = pd.DataFrame(mat2)
ind = ['a','b','c']

mat2.index = ind


mat2

   0  1  2  3  4
a  1  2  3  4  5
b  2  3  4  5  4
c  3  4  5  4  5